## Linux 

- [x] 专栏：[Linux命令行与Shell脚本编程大全](http://www.imooc.com/read/39)



## Summary

### date 调节时间

#### 默认用法

```bash
date
> Sat Mar 21 00:19:06 CST 2020
```

> * Sat：Saturday 的缩写，表示周六
> * Mar：March，表示三月
> * 21：21日，也就是 3 月 21 日；
> * 00:19:06：0 点 19 分 06 秒；
> * CEST：所在时区。CST 是China Standard Time UT+8:00的缩写
> * 2020：2020年。

#### date定制输出

```bash
date "+format"
```

> "+"  后跟定制输出形式
>
> %a     locale's abbreviated weekday name (e.g., Sun)
>
> %A     locale's full weekday name (e.g., Sunday)
>
> %b     locale's abbreviated month name (e.g., Jan)
>
> %B     locale's full month name (e.g., January)
>
> %c     locale's date and time (e.g., Thu Mar  3 23:05:25 2005)
>
> %C     century; like %Y, except omit last two digits (e.g., 20)
>
> %d     day of month (e.g., 01)
>
> %D     date; same as %m/%d/%y
>
> %e     day of month, space padded; same as %_d
>
> %F     full date; same as %Y-%m-%d
>
>  %g     last two digits of year of ISO week number (see %G)
>
>  %h     same as %b
>
> %H     hour (00..23)
>
> %I     hour (01..12)
>
> %j     day of year (001..366)
>
> %k     hour, space padded ( 0..23); same as %_H
>
> %l     hour, space padded ( 1..12); same as %_I
>
> %m     month (01..12)
>
> %M     minute (00..59)

```bash
date "+%H" # 返回当前小时
> 00
date "+%H:%M:%S" # 返回当前时分秒
> 00:30:16
date "+%H时%M分%S秒"
> 00时30分42秒
date "+现在是%Y年"
> 现在是2020年
```

#### 修改系统时间

````bash
sudo date 10121430
````



### at  延时执行一个程序

> at 命令只能让程序执行一次

#### 安装

````bash
sudo apt install at
````

#### 用法

```bash
at time
```

> 1. 先用 at 命令后接想要程序执行的确定时刻
> 2. 再输入你想要在以上指定时刻执行的命令
> 3. at 命令会继续显示 `at>`，提示你输入在指定时刻想要执行的其他命令
> 4. 使用 Ctrl + D 组合键结束at命令，at 会显示EOT ，是“End Of Transmission”（表示“传输结束”）的缩写。
> 5. 返回：job 2 at Sat Mar 21 00:43:00 2020
>    - job：表示创建了一个任务；
>    - 2：是 job 的编号。表示第 2 号任务；
>    - at：“在…时刻”，也正是 at 命令的作用所在；
>    - Sat Mar 21 00:43:00 2020：执行时间

![image.png](https://i.loli.net/2020/03/21/lyqDfW3IxkadTEY.png)



```bash
at 22:10 tomorrow # 明天22:10执行
at 22:10 3/23/20 #2020.3.23 22:10执行
at now +10 minutes # 10分钟后执行
at now +7 weeks # 七周后执行
```

#### 管理at任务

- atq

  > atq 列出正等待执行的 at 任务, at queue

  ```bash
  atq
  ```

- atrm

  > atrm 删除指定at任务

  ```bash
  atrm qid
  ```

  ![image.png](https://i.loli.net/2020/03/21/z4DdlBAtNnMsecS.png)

  

### 命令分割与延时

#### 命令分割

- &&：&& 号前的命令执行成功，才会执行后面的命令。
- ||：|| 号前的命令执行失败，才会执行后面的命令。
- 分号：不论分号前的命令执行成功与否，都执行分号后的命令。前后命令之间没有相关性。

```bash
touch file.txt &&  rm file.txt
cat file.txt || touch file.txt
touch file.txt ;  rm file.txt
```

#### sleep 延时执行

- 用法

  ```bash
  sleep time
  sleep 10 # 休息10s
  sleep 1m # 休息一分钟
  ```

  > 默认地，sleep 后面的数值表示秒数。但我们也可以指定其表示分钟或小时或天：
  >
  > * m：minute 的缩写，表示“分钟”；
  > * h：hour 的缩写，表示“小时”；
  > * d：day 的缩写，表示“天”。

- 举例

  ```bash
  touch file.txt ; sleep 10 ; rm file.txt
  ```

  > touch file.txt ：创建文件 file.txt；
  > sleep 10 ：暂停 10 秒；
  > rm file.txt ：删除 file.txt。

### crontab 定时执行任务

#### 安装启动

```bash
sudo apt install cron
service cron start # 启动
service cron stop # 停止
service cron restart # 重启
```

#### crontab 

- 介绍

  > crontab 用来读取和修改名为 crontab 的文件
  >
  > crontab 文件包含了你要定时执行的程序列表，也包含了执行的时刻。
  >
  > 每个用户有自己的 crontab 文件

- 用法

  - -e  修改crontab文件

    > crontab -e 用于修改 crontab 文件，如果文件不存在，就新建一个

    ```bash
    # 文件书写格式注释
    # m h dom mon dow command
    ```

    > m：minute 的缩写，表示“分钟”；
    >
    > h：hour 的缩写，表示“小时”；
    >
    > dom：day of month 的缩写，表示“一个月的哪一天”；
    >
    > mon：month 的缩写，表示“月份”；
    >
    > dow：day of week 的缩写，表示“星期几”；
    >
    > command：英语“命令”的意思，表示需要定时执行的命令。

    <img src="https://i.loli.net/2020/03/21/inlxwXWEoQhsUJu.png" alt="image.png" style="zoom:30%;" />

    

    > 上图中用 X 表示的五个区域分别是“分钟，小时，日，月份，星期几”，这五个区域要么用数字加符号填充，要么写上一个星号（*），表示任何值。

    ```bash
    # 像crontab文件中追加定时命令
    10 22 * * * touch ~/1.txt # 每天的 22 点 10 分都在家目录下创建 1.txt 文件
    # 保存crontab文件
    > crontab: installing new crontab
    ```

    | Crontab                | 意义                                                         |
    | :--------------------- | :----------------------------------------------------------- |
    | 47 * * * * command     | 每个小时的 47 分都执行 command 命令，也就是 00 点 47 分, 01 点 47 分, 02 点 47 分等等 |
    | 0 0 * * 1 command      | 每个礼拜一的凌晨都执行 command 命令                          |
    | 30 5 1-15 * * command  | 每个月的 1 ~ 15 日的 5 点 30 分都执行 command 命令           |
    | 0 0 * * 1,3,4 command  | 每个礼拜一，礼拜三，礼拜四的凌晨都执行 command 命令          |
    | 0 */2 * * * command    | 每 2 个小时的整点（0，2，4，6，等等）都执行 command 命令     |
    | */10 * * * 1-5 command | 每个礼拜一到礼拜五的每个 10 的倍数的分钟（0，10，20，30，等等）都执行 command 命令 |

  - -r  删除crontab文件

  - -l  显示crontab文件

#### cron

> cron 用于实际执行定时的程序。